from abc import  ABC,abstractmethod

class Repository(ABC):
    @abstractmethod
    def load(self):
        pass

    @abstractmethod
    def save(self,data):
        pass



# Избрах Repository да бъде абстрактен клас, защото искам всички видове хранилища в системата да имат еднакъв интерфейс.
# Абстрактният клас гарантира, че всеки конкретен
# репозиторий задължително ще имплементира методите load() и save(). Това ми позволява да сменям типа хранилище
# (JSON, CSV, база данни) без да променям логиката в контролерите.“

# Абстрактният клас Repository ми позволява да приложа Repository Pattern.
# Това разделя логиката за работа с данни от бизнес логиката. Контролерите работят с абстракцията,
# а не с конкретната имплементация. Така системата става по‑гъвкава, по‑лесна за разширяване и по‑лесна за поддръжка