def anonymous_menu(user):
    while True:
        print("\n=== Меню за гост (Анонимен потребител) ===")
        print("1. Информация за системата")
        print("0. Назад")

        choice = input("Избор: ")

        if choice == "1":
            print("\n=== Информация за системата ===")
            print("WIMS – Система за управление на складови наличности.")
            print("Като анонимен потребител можете да разглеждате само обща информация.")
            print("За достъп до функционалности е необходим вход с акаунт (Оператор или Администратор).")

        elif choice == "0":
            break

        else:
            print("Невалиден избор.")
